{
  "proyects": [
    {
      "proyectName": "FriendList",
      "description": "For this project, I developed a web application that allows users to create a list of their friends and view the list of friends of other users. The goal of this project was to practice my web development skills and create a functional application that demonstrates my abilities.",
      "tech": ["JavaScript", "Next JS", "Tailwind CSS & HTML", "Express"],
      "src": "/proyects/AnimationApiExpress.gif"
    },
    {
      "proyectName": "ChatApp in real time",
      "description": "For this project, I enhanced an existing web application that allows users to create and view lists of friends. I integrated the application with a chat functionality, allowing users to communicate with each other in real-time.In addition to the chat feature, I also made several improvements to the user interface and added new functionality such as the ability to search for and add new friends.",
      "tech": [
        "JavaScript",
        "Next JS",
        "Tailwind CSS & HTML",
        "SWR",
        "Express",
        "Auth0"
      ],
      "src": "/proyects/AnimationVchat.gif"
    },
    {
      "proyectName": "Stripe Web page",
      "description": "The goal of this project was to copy the https://stripe.com/es-us website. Mainly to test react together with tailwind to see how to generate dynamic animations..",
      "tech": ["JavaScript", "React", "Tailwind CSS & HTML"],
      "src": "/proyects/AnimationStripe.gif"
    },
    {
      "proyectName": "Cart App with labels",
      "description": "For this project, I built a web application using React that fetches data from a server and allows the user to filter the data using labels. The application displays the data in a visually appealing and easy-to-use manner. The goal of this project was to gain experience working with React.",
      "tech": ["JavaScript", "React", "CSS & HTML"],
      "src": "/proyects/AnimationCartLabels.gif"
    },
    {
      "proyectName": "ToDo List using localStorage",
      "description": "For this project, I developed a web application using React that allows users to create and manage a to-do list. I implemented the storage of the to-do list using the local storage feature of the user's web browser. The application includes a visually appealing user interface and allows users to add, edit, and delete items on their to-do list.",
      "tech": ["JavaScript", "React", "Tailwind CSS & HTML"],
      "src": "/proyects/AnimationTodo.gif"
    },
    {
      "proyectName": "Self management system of subjects (Desktop)",
      "description": "I developed a desktop application using .NET Framework that allows for self-management of subjects with different roles. Students can use the app to view and sign up for available exams, view their exam schedule and grades, and manage their personal information. Teachers can use the app to upload grades and other relevant information for exams and manage their own personal information. A superuser role allows for the creation and modification of user accounts within the system. The app was built using Windows Forms and has a visually appealing and easy-to-use interface.",
      "tech": [".NET Framework", "Windows Forms", "C#"],
      "src": "/proyects/AnimationSysacad.gif"
    },
    {
      "proyectName": "Self management system of subjects (Web)",
      "description": "Same concept as above, but for browsers.",
      "tech": [".NET Framework", "CSS & HTML", "JavaScript", "ASP.NET"],
      "src": "/proyects/AnimationSysacadWeb.gif"
    }
  ]
}
